{
  "id": "constitucion-politica-mexico",
  "title": "CONSTITUCIÓN POLÍTICA DE LOS ESTADOS UNIDOS MEXICANOS",
  "type": "constitucion",
  "primaryArea": "general",
  "hierarchy": 1,
  "source": "constitucion-politica-mexico.txt",
  "lastUpdated": "2025-08-18T19:47:39.872Z",
  "content": [
    {
      "id": "constitucion-politica-mexico_content",
      "type": "text",
      "title": "CONSTITUCIÓN POLÍTICA DE LOS ESTADOS UNIDOS MEXICANOS",
      "content": "CONSTITUCIÓN POLÍTICA DE LOS ESTADOS UNIDOS MEXICANOS\n\nTÍTULO PRIMERO\nCAPÍTULO I\nDE LOS DERECHOS HUMANOS Y SUS GARANTÍAS\n\nArtículo 1o. En los Estados Unidos Mexicanos todas las personas gozarán de los derechos humanos reconocidos en esta Constitución y en los tratados internacionales de los que el Estado Mexicano sea parte, así como de las garantías para su protección, cuyo ejercicio no podrá restringirse ni suspenderse, salvo en los casos y bajo las condiciones que esta Constitución establece.\n\nLas normas relativas a los derechos humanos se interpretarán de conformidad con esta Constitución y con los tratados internacionales de la materia favoreciendo en todo tiempo a las personas la protección más amplia.\n\nTodas las autoridades, en el ámbito de sus competencias, tienen la obligación de promover, respetar, proteger y garantizar los derechos humanos de conformidad con los principios de universalidad, interdependencia, indivisibilidad y progresividad.\n\nArtículo 2o. La Nación Mexicana es única e indivisible. La Nación tiene una composición pluricultural sustentada originalmente en sus pueblos indígenas que son aquellos que descienden de poblaciones que habitaban en el territorio actual del país al iniciarse la colonización y que conservan sus propias instituciones sociales, económicas, culturales y políticas, o parte de ellas.\n\nArtículo 3o. Toda persona tiene derecho a la educación. El Estado -Federación, Estados, Ciudad de México y Municipios- impartirá y garantizará la educación inicial, preescolar, primaria, secundaria, media superior y superior."
    }
  ]
}